// 2. Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5

// Решение 1.
// void Length (int a)
// {
//     string num = a.ToString();
//     Console.WriteLine (num.Length);
// }
// Length (456);
// Length (78);
// Length (89126);

// Решение 2.
// Console.Clear();
// Console.WriteLine("Введите X: ");
// int x = Convert.ToInt32(Console.ReadLine());
// int index = 0;
// while(x > 0)
// {
//     x = x / 10;
//     index++;
// }
// Console.WriteLine(index);






